{
  "title": "Đảng phải trong sạch, vững mạnh",
  "subtitle": "Đảng là đạo đức, là văn minh",
  "introduction": {
    "quote": "Đảng ta là đạo đức, là văn minh",
    "author": "Hồ Chí Minh",
    "context": "Bài nói tại Lễ Kỷ niệm 30 năm Ngày thành lập Đảng (1960)",
    "description": "Hồ Chí Minh coi đạo đức cách mạng là gốc, là nền tảng của người cách mạng."
  },
  "moralityPoints": [
    {
      "id": 1,
      "title": "Mục đích hoạt động của Đảng",
      "content": "Lãnh đạo đấu tranh giải phóng dân tộc, giải phóng xã hội, giải phóng giai cấp, giải phóng con người. Đó là sự nghiệp cách mạng theo chủ nghĩa Mác - Lênin, làm cho dân tộc được độc lập, nhân dân có cuộc sống ấm no, tự do, hạnh phúc thật sự, đoàn kết hữu nghị với các dân tộc trên thế giới.",
      "highlights": [
        "Giải phóng dân tộc",
        "Giải phóng xã hội",
        "Giải phóng giai cấp",
        "Giải phóng con người"
      ]
    },
    {
      "id": 2,
      "title": "Đảng không có mục đích riêng",
      "content": "Cương lĩnh, đường lối, chủ trương và mọi hoạt động thực tiễn của Đảng đều phải nhằm mục đích phục vụ nhân dân. Đảng phải luôn luôn trung thành với lợi ích toàn dân tộc vì Đảng không có mục đích riêng; sự ra đời và phát triển của Đảng đều vì mục đích làm cho đất nước hùng cường đi lên chủ nghĩa xã hội, đưa lại quyền lợi cho dân.",
      "keyPoints": [
        "Trung thành với lợi ích toàn dân tộc",
        "Không có mục đích riêng ngoài lợi ích dân tộc",
        "Làm cho đất nước hùng cường",
        "Đưa lại quyền lợi cho dân"
      ]
    },
    {
      "id": 3,
      "title": "Đạo đức cán bộ, đảng viên",
      "content": "Đội ngũ đảng viên phải luôn luôn thấm nhuần đạo đức cách mạng, ra sức tu dưỡng, rèn luyện, suốt đời phấn đấu cho lợi ích của dân, của nước.",
      "virtues": {
        "title": "Bốn đức của đảng viên",
        "items": [
          "Cần",
          "Kiệm",
          "Liêm",
          "Chính"
        ]
      },
      "qualities": [
        "Có lòng nhân ái",
        "Tình đồng chí thương yêu lẫn nhau",
        "Trung với Đảng, trung với nước, hiếu với dân",
        "Chí công vô tư",
        "Tinh thần quốc tế trong sáng"
      ],
      "quote": "Giàu sang không thể quyến rũ, Nghèo khó không thể chuyển lay, Uy lực không thể khuất phục",
      "servantQuotes": [
        {
          "text": "Mỗi đảng viên và cán bộ phải thật sự thấm nhuần đạo đức cách mạng, thật sự cần kiệm liêm chính, chí công vô tư. Phải giữ gìn Đảng ta thật trong sạch, phải xứng đáng là người lãnh đạo, là người đầy tớ thật trung thành của nhân dân",
          "author": "Hồ Chí Minh"
        },
        {
          "text": "Đảng phải sẵn sàng vui vẻ làm trâu ngựa, làm tôi tớ trung thành của nhân dân",
          "author": "Hồ Chí Minh"
        }
      ]
    }
  ],
  "civilizedParty": {
    "title": "Đảng văn minh",
    "description": "Xây dựng Đảng Cộng sản Việt Nam thành một Đảng có đạo đức cách mạng, cũng tức là xây dựng Đảng để Đảng trở thành một Đảng văn minh, hoặc Hồ Chí Minh hay gọi đó là 'một Đảng cách mạng chân chính'.",
    "characteristics": [
      {
        "id": 4,
        "title": "Tiêu biểu cho lương tâm, trí tuệ và danh dự của dân tộc",
        "content": "Đảng văn minh là một Đảng tiêu biểu cho lương tâm, trí tuệ và danh dự của dân tộc."
      },
      {
        "id": 5,
        "title": "Phù hợp với quy luật phát triển văn minh",
        "content": "Đảng ra đời là một tất yếu, phù hợp với quy luật phát triển văn minh tiến bộ của dân tộc và của nhân loại. Mọi hoạt động của Đảng đều xuất phát từ yêu cầu phát triển của dân tộc, lấy lợi ích tối cao của dân tộc làm trọng, mọi lợi ích giai cấp đều phải đặt dưới sự phát triển của dân tộc; mọi hoạt động của Đảng đều phải phù hợp với quy luật vận động của xã hội Việt Nam."
      },
      {
        "id": 6,
        "title": "Trong sạch, vững mạnh, làm tròn sứ mệnh lịch sử",
        "content": "Đảng phải luôn trong sạch, vững mạnh, làm tròn sứ mệnh lịch sử do nhân dân, dân tộc giao phó là lãnh đạo giành độc lập cho Tổ quốc và đưa lại tự do, ấm no, hạnh phúc cho nhân dân. Trong giai đoạn Đảng cầm quyền, Hồ Chí Minh càng chú trọng hơn việc phòng và chống các tiêu cực trong Đảng."
      },
      {
        "id": 7,
        "title": "Hoạt động trong khuôn khổ Hiến pháp và pháp luật",
        "content": "Xây dựng Đảng văn minh còn thể hiện trong giai đoạn cầm quyền, Đảng hoạt động trong khuôn khổ Hiến pháp và pháp luật, Đảng không phải là tổ chức đứng trên dân tộc."
      },
      {
        "id": 8,
        "title": "Đảng viên là chiến sĩ tiên phong, gương mẫu",
        "content": "Đảng văn minh còn là ở chỗ đội ngũ đảng viên, từ những đảng viên giữ chức vụ lãnh đạo, quản lý trong bộ máy Đảng, Nhà nước, các đoàn thể quần chúng, nhất là những đảng viên giữ vị trí lãnh đạo, quản lý chủ chốt, cho đến đảng viên không giữ chức vụ lãnh đạo, quản lý phải là những chiến sĩ tiên phong, gương mẫu trong công tác và cuộc sống hàng ngày."
      },
      {
        "id": 9,
        "title": "Quan hệ quốc tế trong sáng",
        "content": "Đảng văn minh phải là Đảng có quan hệ quốc tế trong sáng, hoạt động không những vì lợi ích dân tộc Việt Nam mà còn vì độc lập, chủ quyền, thống nhất, toàn vẹn lãnh thổ của các quốc gia khác; vì hòa bình, hữu nghị, hợp tác cùng phát triển của các dân tộc trên thế giới."
      }
    ]
  },
  "warning": {
    "title": "Cảnh báo của Hồ Chí Minh",
    "quote": "Một dân tộc, một đảng và mỗi con người, ngày hôm qua là vĩ đại, có sức hấp dẫn lớn, không nhất định hôm nay và ngày mai vẫn được mọi người yêu mến và ca ngợi, nếu lòng dạ không trong sáng nữa, nếu sa vào chủ nghĩa cá nhân",
    "author": "Hồ Chí Minh",
    "message": "Nếu Đảng không đạo đức, văn minh thì Đảng sẽ bị mất quyền lãnh đạo và khi đó Đảng chứng tỏ là một tổ chức không trong sạch, vững mạnh, đội ngũ cán bộ, đảng viên thoái hoá, biến chất."
  },
  "conclusion": {
    "text": "Xây dựng Đảng để cho Đảng xứng đáng là Đảng đạo đức, văn minh là một nội dung đặc sắc trong tư tưởng Hồ Chí Minh về Đảng Cộng sản Việt Nam, là bước phát triển sáng tạo của Người so với lý luận của V.I.Lênin về đảng kiểu mới của giai cấp vô sản."
  }
}