{
  "anh1.jpg": {
    "title": "Vai trò lãnh đạo của Đảng: Người cầm lái vĩ đại",
    "description": "Hình ảnh này thể hiện tư tưởng của Hồ Chí Minh coi Đảng Cộng sản Việt Nam như người cầm lái con thuyền cách mạng, vượt qua sóng gió để đưa dân tộc đến bến bờ vinh quang, dưới ánh sáng soi đường của Người."
  },
  "anh2.jpg": {
    "title": "Chống \"giặc nội xâm\", xây dựng Nhà nước trong sạch",
    "description": "Hình ảnh mang tính biểu tượng cao này thể hiện quyết tâm đấu tranh không khoan nhượng với các tệ nạn tham nhũng, lãng phí, quan liêu - những thứ mà Hồ Chí Minh gọi là \"giặc nội xâm\" - để xây dựng một bộ máy nhà nước thực sự trong sạch, vững mạnh."
  },
  "anh3.jpg": {
    "title": "Đoàn kết là sức mạnh",
    "description": "Bức tranh lụa mềm mại thể hiện sự đoàn kết, thống nhất giữa các thế hệ đảng viên, các lực lượng vũ trang và nhân dân, cùng chung tay xây dựng và bảo vệ Tổ quốc dưới ngọn cờ của Đảng."
  },
  "anh4.jpg": {
    "title": "Lắng nghe ý kiến nhân dân",
    "description": "Phong cách tranh khắc gỗ mộc mạc diễn tả cảnh cán bộ về cơ sở, ngồi cùng người dân để lắng nghe tâm tư, nguyện vọng của họ, thể hiện mối liên hệ mật thiết giữa Đảng và quần chúng."
  },
  "anh5.jpg": {
    "title": "Tự phê bình và phê bình",
    "description": "Bức tranh bột màu (gouache) với gam màu trầm, nghiêm túc, mô tả một buổi sinh hoạt chi bộ nơi các đảng viên thực hiện tự phê bình và phê bình để rèn luyện đạo đức cách mạng, giữ gìn sự trong sạch của Đảng."
  },
  "anh6.jpg": {
    "title": "Pháp quyền nhân nghĩa",
    "description": "Hình ảnh biểu tượng với cán cân công lý, sách luật và trái tim được vẽ theo phong cách sơn dầu trang trọng, thể hiện tư tưởng về một nền pháp trị vừa nghiêm minh, vừa nhân văn, vì con người."
  },
  "anh7.jpg": {
    "title": "Vừa hồng vừa chuyên",
    "description": "Phong cách tranh cổ động với màu sắc tươi sáng, nét vẽ khỏe khoắn, khắc họa hình ảnh thế hệ trẻ đầy nhiệt huyết, vừa nắm vững lý luận, vừa hăng say lao động, cống hiến cho đất nước, thực hiện lời dạy của Bác Hồ về xây dựng đội ngũ cán bộ vừa \"hồng\" vừa \"chuyên\"."
  },
  "anh8.jpg": {
    "title": "Đảng là đạo đức, là văn minh",
    "description": "Bức tranh cổ động với màu sắc ấm áp thể hiện hình ảnh một đảng viên đang dạy trẻ em học, chăm sóc người già, thể hiện tinh thần \"Đảng là đạo đức, là văn minh\", luôn quan tâm đến đời sống vật chất và tinh thần của nhân dân."
  },
  "anh9.jpg": {
    "title": "Cán bộ đi trước, làng nước theo sau",
    "description": "Phong cách tranh cổ động đầy tính hành động, mô tả người cán bộ lãnh đạo xắn tay áo cùng bộ đội và nhân dân dọn dẹp sau bão lũ. Hình ảnh này là minh chứng sống động cho nguyên tắc \"cán bộ đi trước, làng nước theo sau\", luôn nêu gương trong mọi hoàn cảnh."
  },
  "anh10.jpg": {
    "title": "Nhà nước hợp hiến, hợp pháp",
    "description": "Bức tranh tái hiện không khí của cuộc Tổng tuyển cử đầu tiên năm 1946, với người dân từ mọi tầng lớp nô nức đi bỏ phiếu, khẳng định tính chất hợp hiến, hợp pháp của Nhà nước Việt Nam Dân chủ Cộng hòa ngay từ khi mới ra đời."
  },
  "anh11.jpg": {
    "title": "Sống và làm việc theo Hiến pháp và pháp luật",
    "description": "Bức tranh mang tính giáo dục cao, mô tả một buổi tuyên truyền pháp luật tại thôn bản, nhấn mạnh tầm quan trọng của việc nâng cao dân trí và ý thức pháp luật cho nhân dân để xây dựng Nhà nước pháp quyền."
  },
  "anh12.jpg": {
    "title": "Tập trung dân chủ",
    "description": "Bức tranh sơn dầu tái hiện một cuộc họp Đảng, nơi nguyên tắc tập trung dân chủ được thực hiện. Các đảng viên sôi nổi thảo luận để đi đến sự thống nhất về ý chí và hành động, thể hiện sức mạnh của trí tuệ tập thể."
  },
  "anh13.jpg": {
    "title": "Kỷ luật nghiêm minh",
    "description": "Tác phẩm sơn dầu với tông màu trầm, trang nghiêm, mô tả một buổi công bố quyết định kỷ luật. Hình ảnh này nhấn mạnh tính nghiêm minh của kỷ luật Đảng, một yếu tố then chốt để giữ gìn sự trong sạch và sức mạnh của tổ chức."
  },
  "anh14.jpg": {
    "title": "Thường xuyên tự chỉnh đốn",
    "description": "Bức tranh mang tính ẩn dụ sâu sắc về sự tự soi xét và chỉnh đốn của người đảng viên. Hình ảnh người cán bộ nhìn vào gương để tự kiểm điểm là minh chứng cho tinh thần \"tự phê bình và phê bình\" như một việc làm thường xuyên để không ngừng tiến bộ."
  },
  "anh15.jpg": {
    "title": "Nhà nước vì dân",
    "description": "Bức tranh sơn dầu với phong cách hiện thực xã hội chủ nghĩa mô tả một công trường xây dựng bệnh viện nhộn nhịp, thể hiện mục tiêu cao cả của Nhà nước là phục vụ lợi ích, chăm lo đời sống và hạnh phúc của nhân dân."
  },
  "anh16.jpg": {
    "title": "Nâng cao dân trí",
    "description": "Tác phẩm sơn dầu mang không khí ấm áp của một lớp học cộng đồng vào ban đêm. Hình ảnh người dân chăm chú học tập thể hiện tầm quan trọng của việc nâng cao dân trí để phát huy quyền làm chủ của nhân dân trong xây dựng đất nước."
  }
}